src/cf/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/УправлениеКонтактнойИнформациейУНФКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИмяЭлементаДляРазмещения(Форма, Элемент) Экспорт
	
	ОтборРеквизитов = Новый Структура("ИмяРеквизита", Элемент.Имя);
	ОписаниеРеквизитаКИ = Форма["КонтактнаяИнформацияОписаниеДополнительныхРеквизитов"].НайтиСтроки(ОтборРеквизитов);
	Если ОписаниеРеквизитаКИ.Количество() <> 0 Тогда
		ИмяЭлементаДляРазмещения = ОписаниеРеквизитаКИ[0].ИмяЭлементаДляРазмещения;
	Иначе
		ИмяЭлементаДляРазмещения = Неопределено;
	КонецЕсли;
	
	Возврат ИмяЭлементаДляРазмещения;
	
КонецФункции

Функция ОбработчикДействияПозвонитьПоТелефону(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	Если ПустаяСтрока(КонтактнаяИнформация.Представление)
		И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяРеквизита) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для совершения звонка заполните номер телефона.'"), , ДополнительныеПараметры.ИмяРеквизита);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТелефонияКлиент.ПоддерживаютсяВызовы() Тогда
		ТелефонияКлиент.ПозвонитьПоНомеру(КонтактнаяИнформация.Представление, ДополнительныеПараметры.ВладелецКонтактнойИнформации);
	Иначе
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытияПоТипуКонтактнойИнформации(КонтактнаяИнформация.Тип));
		ЗначенияЗаполнения.Вставить("ОснованиеЗаполнения", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
		ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ДополнительныеПараметры.Форма);
	КонецЕсли;
	
КонецФункции

// Выполняет открытие формы создания документа Событие (телефонный звонок) для планирования звонка контрагенту
//
// Параметры:
//  КонтактнаяИнформация - Структура - информация о контактном телефоне контрагнета.
//  ДополнительныеПараметры - Структура - данные по форме клиентского приложения из которого выполнен вызов процедуры.
//
Функция ОбработчикДействияЗапланироватьЗвонок(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	Если ПустаяСтрока(КонтактнаяИнформация.Представление)
		И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяРеквизита) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для совершения звонка заполните номер телефона.'"), , ДополнительныеПараметры.ИмяРеквизита);
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытияПоТипуКонтактнойИнформации(КонтактнаяИнформация.Тип));
	ЗначенияЗаполнения.Вставить("ОснованиеЗаполнения", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
	ЗначенияЗаполнения.Вставить("ИспользоватьНастройкиТелефонии", Ложь);
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ДополнительныеПараметры.Форма);
	
КонецФункции

Функция ОбработчикДействияНаписатьTelegram(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(КонтактнаяИнформация.Представление);
	Ссылка = "https://t.me/%1";
	Ссылка = СтрШаблон(Ссылка, НомерТелефона);
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	
КонецФункции

Функция ОбработчикДействияНаписатьWhatsApp(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(КонтактнаяИнформация.Представление);
	Ссылка = "https://wa.me/%1";
	Ссылка = СтрШаблон(Ссылка, НомерТелефона);
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	
КонецФункции

Функция ОбработчикДействияЛичнаяВстреча(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытияПоТипуКонтактнойИнформации(КонтактнаяИнформация.Тип));
	ЗначенияЗаполнения.Вставить("ОснованиеЗаполнения", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ДополнительныеПараметры.Форма);
	
КонецФункции

Функция ОбработчикДействияПрочееСобытие(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытияПоТипуКонтактнойИнформации(КонтактнаяИнформация.Тип));
	ЗначенияЗаполнения.Вставить("ОснованиеЗаполнения", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ДополнительныеПараметры.Форма);
	
КонецФункции

Функция ОбработчикДействияНастроитьСвойстваАдреса(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
    
	КИОписаниеДополнительныхРеквизитов =
	ДополнительныеПараметры.Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	Если КИОписаниеДополнительныхРеквизитов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Отбор = Новый Структура( "Вид", КонтактнаяИнформация.Вид );
    КИОписаниеДополнительныхРеквизитовСтроки = КИОписаниеДополнительныхРеквизитов.НайтиСтроки( Отбор );
    Если КИОписаниеДополнительныхРеквизитовСтроки.Количество() = 0 Тогда
    	Возврат Неопределено;
    КонецЕсли;

   	КИОписаниеДополнительныхРеквизитовСтрока = КИОписаниеДополнительныхРеквизитовСтроки[0];	
	ИмяЭлементаДляРазмещения = КИОписаниеДополнительныхРеквизитовСтрока.ИмяЭлементаДляРазмещения;

	ДополнительныеПараметры.Вставить( "ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
    ДополнительныеПараметры.Вставить( "ВидКонтактнойИнформации", КонтактнаяИнформация.Вид );
    
   	Если КИОписаниеДополнительныхРеквизитовСтрока.ХранитьИсториюИзменений = Ложь Тогда
   	
	    // если хранение истории не включено, то предложим включить и поменять вид поля на "Диалог",
    	// так как в текущей версии БСП хранение истории допустимо только для "Диалог"
    	
		ОповещениеОЗавершении = Новый ОписаниеОповещения( 
		"НастроитьСвойстваАдресаПослеВопросаВключенияИстории", 
		УправлениеКонтактнойИнформациейУНФКлиент, 
		ДополнительныеПараметры);
   		
   		ВопросШаблон = НСтр( "ru = 'Для включения хранения истории вида адреса ""%1"" необходимо поменять способ ввода на ""Диалог"".
                              |Продолжить ?'" );
   		ВопросТекст = СтрШаблон( ВопросШаблон, КонтактнаяИнформация.Вид );
   		ПоказатьВопрос( ОповещениеОЗавершении, ВопросТекст, РежимДиалогаВопрос.ДаНетОтмена, , , 
   		НСтр( "ru = 'Включение истории для адреса'" ) );
   	КонецЕсли;
   	
    Возврат Неопределено;
	
КонецФункции

Функция ОбработчикДействияНаписатьВМессенджерWhatsApp(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	МессенджерыWhatsAppКлиент.ОбработчикДействияНаписатьВМессенджерWhatsApp(КонтактнаяИнформация,
		ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФукнции

Процедура НастроитьСвойстваАдресаПослеЗавершения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Результат = Неопределено;
    УправлениеКонтактнойИнформациейКлиент.ПослеЗакрытияФормыСпискаВидыКонтактнойИнформации(Результат,
    	ДополнительныеПараметры);
		
КонецПроцедуры

Процедура НастроитьСвойстваАдресаПослеВопросаВключенияИстории(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если КонтактнаяИнформацияУНФВызовСервера.АдресВключитьХранениеИстории( 
		ДополнительныеПараметры.ВидКонтактнойИнформации ) <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Неопределено;
	УправлениеКонтактнойИнформациейКлиент.ПослеЗакрытияФормыСпискаВидыКонтактнойИнформации(Результат,
		ДополнительныеПараметры);
	
КонецПроцедуры

Функция ТипСобытияПоТипуКонтактнойИнформации(ТипКИ)
	
	Если ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Skype") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЛичнаяВстреча");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Другое") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок");
	Иначе
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ТипСобытия;
	
КонецФункции

#КонецОбласти
